Repository: abelhailefen/mgw_tutorial
Catalog: lib/l10n/app_*.arb
Languages: am, or

# downloadDocumentTooltip
source: Download PDF
am: ፒዲኤፍ አውርድ
or: PDF Buusi

# downloadedDocumentTooltip
source: Open downloaded PDF
am: የወረደውን ፒዲኤፍ ክፈት
or: PDF Buufame Banaa

# notesItemType
source: Notes
am: ማስታወሻዎች
or: Qabxii

# examsItemType
source: Exams
am: ፈተናዎች
or: Qormaata

# noNotesAvailable
source: No notes available for this section
am: ለዚህ ክፍል ምንም ማስታወሻ የለም።
or: Kutaa kanaaf qabxiin hin jiru.

# noExamsAvailable
source: No exams available for this section
am: ለዚህ ክፍል ምንም ፈተና የለም።
or: Kutaa kanaaf qormaanni hin jiru.

# appTitle
source: MGW Tutorial
am: MGW ትምህርት
or: Hubannoo MGW

source: Home
am: መነሻ
or: Fuula Duraa

source: Library
am: ቤተ-መጻሕፍት
or: Kitaabota

source: Notifications
am: ማሳወቂያዎች
or: Beeksisa

source: Account
am: መለያ
or: Akkaawuntii

source: About Us
am: ስለ እኛ
or: Waa'ee Keenyaa

source: Settings
am: ቅንብሮች
or: Faayidaa

source: Logout
am: ውጣ
or: Ba'i

source: Change Language
am: ቋንቋ ቀይር
or: Afaan Jijjiiri

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ
or: Amaariffa

source: Tigrigna
am: ትግርኛ

source: Afaan Oromo
am: አፋን ኦሮሞ

# welcomeMessage
source: Welcome to MGW Tutorial!
am: ወደ MGW ትምህርት እንኳን ደህና መጡ!
or: Hubannoo MGWtti baga nagaan dhuftan!

source: Testimonials
am: ምስክርነቶች
or: Ragaawwan

# registerforcourses
source: Enroll for Courses
am: ትምህርቶች ይመዝገቡ
or: Koorsootaaf Galmaa'i

source: My Courses
am: የኔ ትምህርቶች
or: Koorsoota Kiyya

# weeklyexam
source: Weekly Exams
am: ሳምንታዊ ፈተና
or: Qormaata Torbanii

source: Share the App
am: መተግበሪያውን ያጋሩ
or: Appilikeeshinii Hiri

source: Join our Telegram
am: የእኛን ቴሌግራም ይቀላቀሉ
or: Telegraama Keenyaatti Makami

source: Discussion Group
am: የውይይት ቡድን
or: Maree Garee

source: Contact Us
am: አግኙን
or: Nu Qunnamaa

source: Refresh
am: አድስ
or: Haaroomsi

# getRegisteredTitle
source: Create Account
am: መለያ ይፍጠሩ
or: Akkaawuntii Uumi

# studentNameLabel
source: Student's Name
am: የተማሪ ስም
or: Maqaa Barataa

# studentNameValidationError
source: Please enter student's name
am: እባክዎ የተማሪውን ስም ያስገቡ።
or: Maqaa barataa galchi.

# fatherNameLabel
source: Father's Name
am: የአባት ስም
or: Maqaa Abbaa

# fatherNameValidationError
source: Please enter father's name
am: እባክዎ የአባትን ስም ያስገቡ።
or: Maqaa abbaa galchi.

# streamLabel
source: Department
am: ቅርንጫፍ
or: Damee Barnootaa

# naturalStream
source: Natural
am: የተፈጥሮ ሳይንስ
or: Saayinsii Uumamaa

# socialStream
source: Social
am: ማህበራዊ ሳይንስ
or: Saayinsii Hawaasaa

# institutionLabel
source: Institution
am: ተቋም
or: Mana Barumsaa/Dhaabbata

# selectInstitutionHint
source: Select Institution
am: ተቋም ይምረጡ
or: Mana Barumsaa/Dhaabbata Filadhu

# institutionValidationError
source: Please select institution
am: እባክዎ ተቋም ይምረጡ።
or: Dhaabbata filadhu.

# genderLabel
source: Gender
am: ጾታ
or: Saala

# maleGender
source: Male
am: ወንድ
or: Dhiira

# femaleGender
source: Female
am: ሴት
or: Durba

# selectServiceLabel
source: Select Service
am: አገልግሎት ይምረጡ
or: Tajaajila Filadhu

# selectServiceHint
source: Select Service
am: አገልግሎት ይምረጡ
or: Tajaajila Filadhu

# serviceValidationError
source: Please select a service
am: እባክዎ አገልግሎት ይምረጡ።
or: Tajaajila filadhu.

# paymentInstruction
source: After making the payment, please enter the name of the bank you used below and attach the payment confirmation screenshot. Our Bank Account Details: • CBE: 1000 XXX XXXX XXXX (Debebe W.) • Telebirr: 09XX XXX XXX (Debebe W.)
am: ክፍያ ከፈጸሙ በኋላ እባክዎ የተጠቀሙበትን የባንክ ስም ከታች ያስገቡ እና የክፍያ ማረጋገጫ ቅጽበታዊ ገጽ እይታ ያያይዙ። የእኛ የባንክ ሂሳብ መረጃ: • ንብ ባንክ: 1000 XXX XXXX XXXX (ደበበ ወ.) • ተለብር: 09XX XXX XXX (ደበበ ወ.)
or: Erga kaffaltii gootee booda, maqaa baankii ati itti fayyadamte gadiitti galchiitii suuraa kaffaltii mirkaneessu maxxansi. Odeeffannoo Baankii Keenyaa: • CBE: 1000 XXX XXXX XXXX (Dabebee W.) • Telebirr: 09XX XXX XXX (Dabebee W.)

# bankAccountLabel
source: Account
am: ሂሳብ
or: Akkaawuntii

# bankHolderNameLabel
source: Name
am: ስም
or: Maqaa

# copiedToClipboardMessage
source: {accountNumber} copied to clipboard!
am: {accountNumber} ወደ ክሊፕቦርድ ተቀድቷል!
or: {accountNumber} to clipboard waan godhame!

source: Could not open file: {error}
am: ፋይሉን መክፈት አልተቻለም: {error}
or: Faayilii banuu hin dandeenye: {error}

# couldNotFindDownloadedFileError
source: Could not find the downloaded file.
am: የወረደውን ፋይል ማግኘት አልተቻለም።
or: Faayilii buufame argachuu hin dandeenye.

# videoIsDownloadingMessage
source: Video is currently downloading. Please wait.
am: ቪዲዮው እየወረደ ነው። እባክዎ ይጠብቁ።
or: Viidiyoon amma bu'aa jira. Turii eegi.

# videoDownloadFailedMessage
source: Video download failed. Tap download button to retry.
am: የቪዲዮ ማውረድ አልተሳካም። እንደገና ለማውረድ የማውረጃ አዝራሩን ይጫኑ።
or: Viidiyoon bu'uu hin dandeenye. Deebisee yaaluuf buttana buusuu tuqi.

# videoDownloadCancelledMessage
source: Video download was cancelled.
am: የቪዲዮ ማውረድ ተሰርዟል።
or: Viidiyoon buusuu ni hafe.

# notImplementedMessage
source: Not implemented
am: አልተተገበረም
or: Hojiirra hin oolle

source: No text content.
am: ምንም የጽሑፍ ይዘት የለም።
or: Qabxii barreeffamaa hin jiru.

# closeButtonText
source: Close
am: ዝጋ
or: Cufi

# downloadVideoTooltip
source: Download video for offline viewing
am: ቪዲዮውን ከመስመር ውጪ ለማየት ያውርዱ
or: Viidiyoo offline ilaaluuf buusi

# downloadedVideoTooltip
source: Video downloaded. Tap to play, long press to delete.
am: ቪዲዮ ወርዷል። ለመጫወት ይጫኑ፣ ለመሰረዝ ረጅም ይጫኑ።
or: Viidiyoo buufameera. Taphachuuf tuqi, haquuf yeroo dheeraaf tuqi.

# downloadFailedTooltip
source: Download failed. Tap to retry.
am: ማውረድ አልተሳካም። እንደገና ለመሞከር ይጫኑ።
or: Buusuun hin milkoofne. Deebisee yaaluuf tuqi.

# deleteDownloadedFileTooltip
source: Delete downloaded file
am: የወረደውን ፋይል ሰርዝ
or: Faayilii buufame haqi

# couldNotDeleteFileError
source: Could not delete file: Invalid lesson data.
am: ፋይል መሰረዝ አልተቻለም: ትክክል ያልሆነ የትምህርት ውሂብ።
or: Faayilii haquu hin dandeenye: Odeeffannoo barnootaa sirrii hin taane.

source: File deleted successfully
am: ፋይል በተሳካ ሁኔታ ተሰርዟል።
or: Faayiliin milkaa'inaan haqameera.

source: File not found or failed to delete
am: ፋይል አልተገኘም ወይም መሰረዝ አልተሳካም።
or: Faayiliin hin argamne ykn haquun hin milkoofne.

# attachScreenshotButton
source: Attach Screenshot
am: ቅጽበታዊ ገጽ ያያይዙ
or: Suuraa Maxxansi

# screenshotAttachedButton
source: Screenshot Attached!
am: ቅጽበታዊ ገጽ ተያይዟል!
or: Suuraa Maxxanfameera!

# fileNamePrefix
source: File
am: ፋይል
or: Faayilii

# termsAndConditionsAgreement
source: By continuing you are agreeing to the
am: በመቀጠልዎ እርስዎ የ
or: Itti fufuun kee waliigaltee

# termsAndConditionsLink
source: terms and condition
am: አገልግሎት ውል
or: waliigaltee fi haalawwan

# termsAndConditionsAnd
source: and
am: እና የ
or: fi

# privacyPolicyLink
source: privacy policy
am: የግላዊነት ፖሊሲን
or: seera dhuunfaa

# submitButton
source: Create Account
am: መለያ ፍጠር
or: Akkaawuntii Uumi

# errorPickingImage
source: Error picking image: {errorMessage}
am: ምስል ለመምረጥ ስህተት: {errorMessage}
or: Suuraa filachuutti dogoggora: {errorMessage}

# pleaseSelectStreamError
source: Please select a Department.
am: እባክዎ ቅርንጫፍ ይምረጡ።
or: Damee barnootaa filadhu.

# pleaseSelectInstitutionError
source: Please select an institution.
am: እባክዎ ተቋም ይምረጡ።
or: Dhaabbata filadhu.

# pleaseSelectGenderError
source: Please select your gender.
am: እባክዎ ጾታዎን ይምረጡ።
or: Saala kee filadhu.

# pleaseSelectServiceError
source: Please select a service.
am: እባክዎ አገልግሎት ይምረጡ።
or: Tajaajila filadhu.

# pleaseAttachScreenshotError
source: Please attach a payment screenshot.
am: እባክዎ የክፍያ ቅጽበታዊ ገጽ ያያይዙ።
or: Suuraa kaffaltii maxxansi.

# pleaseAgreeToTermsError
source: Please agree to the terms and conditions.
am: እባክዎ ከአገልግሎት ውል ጋር ይስማሙ።
or: Waliigaltee fi haalawwaniif tole jedhi.

# notRegisteredTitle
source: Looks like you're not registered yet
am: እስካሁን አልተመዘገቡም ይመስላል
or: Hanga ammaatti akka hin galmoofne ni fakkaata

# notRegisteredSubtitle
source: Fill out the form to register and access our educational resources to boost your grades.
am: ለመመዝገብ እና የትምህርት ምንጮቻችንን ለመድረስ ቅጹን ይሙሉ እና ውጤቶችዎን ያሳድጉ።
or: Galmaa'uufi madda barnootaa keenya fayyadamuun qabxii kee guddisuuf foormii guuti.

# getRegisteredNowButton
source: Get Registered Now
am: አሁን ይመዝገቡ
or: Amma Galmaa'i

# mgwTutorialTitle
source: MGW Tutorial
am: MGW ትምህርት
or: Hubannoo MGW

source: Sign up to start learning
am: መማር ለመጀመር ይመዝገቡ
or: Barnoota jalqabuuf galmaa'i

# signUpTitle
source: Create Account
am: መለያ ፍጠር
or: Akkaawuntii Uumi

# createAccountButton
source: Create Account
am: መለያ ፍጠር
or: Akkaawuntii Uumi

# alreadyHaveAccount
source: Already have an account?
am: ቀደም ሲል መለያ አለዎት?
or: Akkaawuntii qabdaa?

# signInLink
source: Sign In
am: ግባ
or: Seeni

# signUpSuccessMessage
source: Account created successfully! You can now sign in.
am: መለያ በተሳካ ሁኔታ ተፈጥሯል! አሁን መግባት ይችላሉ።
or: Akkaawuntiin milkaa'inaan uumame! Amma seenuu dandeessa.

# signUpFailedErrorGeneral
source: Sign up failed. Please try again.
am: ምዝገባ አልተሳካም። እባክዎ እንደገና ይሞክሩ።
or: Galmeessi hin milkoofne. Deebisee yaali.

# loginTitle
source: Sign In
am: ግባ
or: Seeni

# loginToContinue
source: Welcome To MGW, Your Smarter Freshman Path To Straight A+/A’s in Every Course.
am: እንኳን ወደ MGW በደህና መጡ፣ በእያንዳንዱ ትምህርት A+/A ለማግኘት ብልህ የሆነው የመጀመሪያ ዓመት መንገድዎ።
or: Baga gara MGWtti nagaan dhuftan, karaa barattoota haaraa sadarkaa A+/A ta'uu keessan mirkaneessu.

# signInButton
source: Sign In
am: ግባ
or: Seeni

# dontHaveAccount
source: Don't have an account?
am: መለያ የለዎትም?
or: Akkaawuntii hin qabdu?

# signUpLinkText
source: Create Now
am: አሁን ፍጠር
or: Amma Uumi

# phoneNumberLabel
source: Phone Number
am: የስልክ ቁጥር
or: Lakkoofsa Bilbilaa

# phoneNumberValidationErrorRequired
source: Please enter your phone number
am: እባክዎ ስልክ ቁጥርዎን ያስገቡ።
or: Lakkoofsa bilbilaa kee galchi.

# phoneNumberValidationErrorInvalid
source: Enter a valid 9-digit phone number
am: ትክክለኛ ባለ 9-አሃዝ ስልክ ቁጥር ያስገቡ።
or: Lakkoofsa bilbilaa digit 9 qabu galchi.

# passwordLabel
source: Password
am: የይለፍ ቃል
or: Jecha Darbii

# passwordHint
source: Enter your password
am: የይለፍ ቃልዎን ያስገቡ
or: Jecha darbii kee galchi

# passwordValidationErrorRequired
source: Please enter your password
am: እባክዎ የይለፍ ቃልዎን ያስገቡ።
or: Jecha darbii kee galchi.

# passwordValidationErrorLength
source: Password must be at least 6 characters
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች መሆን አለበት።
or: Jechi darbii gabaabduu ta'uu hin qabu, yoo xiqqaate qubee 6 ta'uu qaba.

# accountCreationSimulatedMessage
source: Account creation simulated. Check console.
am: የመለያ መፍጠር ተኮርቷል። ኮንሶሉን ይመልከቱ።
or: Akkaawuntii uumuun fakkeeffameera. Console ilaali.

# loginSuccessMessage
source: Login successful! Welcome back.
am: በተሳካ ሁኔታ ገብቷል! እንኳን ደህና መጡ።
or: Seenun milkaa'eera! Baga nagaan deebite.

# signInFailedErrorGeneral
source: Sign in failed. Please check your credentials and try again.
am: መግባት አልተሳካም። እባክዎ መረጃዎትን ያረጋግጡ እና እንደገና ይሞክሩ።
or: Seenun hin milkoofne. Odeeffannoo kee mirkaneeffadhuutii deebisee yaali.

# changeProfilePictureButton
source: Change Profile Picture
am: የመገለጫ ስዕል ቀይር
or: Suuraa Profayilii Jijjiiri

# profilePictureSelectedMessage
source: Profile picture selected! (Not Uploaded)
am: የመገለጫ ስዕል ተመርጧል! (አልተሰቀለም)
or: Suuraan profayilii filatameera! (Hin maxxanfne)

# accountPhoneNumberLabel
source: Phone number
am: የስልክ ቁጥር
or: Lakkoofsa bilbilaa

# changePhoneNumberNotImplementedMessage
source: Change Phone Number Tapped (Not Implemented)
am: የስልክ ቁጥር ቀይር ተጫነ (አልተተገበረም)
or: Lakkoofsa Bilbilaa Jijjiiri Tuqameera (Hojiirra Hin Oolle)

# accountPasswordLabel
source: Password
am: የይለፍ ቃል
or: Jecha Darbii

# changePasswordNotImplementedMessage
source: Change Password Tapped (Not Implemented)
am: የይለፍ ቃል ቀይር ተጫነ (አልተተገበረም)
or: Jecha Darbii Jijjiiri Tuqameera (Hojiirra Hin Oolle)

# notificationsEnabledMessage
source: Notifications Enabled
am: ማሳወቂያዎች ነቅተዋል
or: Beeksisni banaa dha

# notificationsDisabledMessage
source: Notifications Disabled
am: ማሳወቂያዎች ተሰናክለዋል
or: Beeksisni cufaa dha

# changeButton
source: Change
am: ቀይር
or: Jijjiiri

# phoneNumberCannotBeEmptyError
source: Phone number cannot be empty.
am: የስልክ ቁጥር ባዶ መሆን የለበትም።
or: Lakkoofsi bilbilaa duwwaa ta'uu hin qabu.

# invalidPhoneNumberFormatError
source: Invalid phone number format. Use 09..., 9..., or +2519...
am: ልክ ያልሆነ የስልክ ቁጥር ቅርጸት። 09..., 9..., ወይም +2519... ይጠቀሙ።
or: Faayila lakkoofsa bilbilaa sirrii hin taane. 09..., 9..., ykn +2519... fayyadami.

# registrationSuccessMessage
source: Registration successful! Please await admin approval.
am: ምዝገባ በተሳካ ሁኔታ ተጠናቋል! እባክዎ የአድሚን ማፅደቅ ይጠብቁ።
or: Galmeessi milkaa'eera! Hayyama admin eegi.

# registrationFailedDefaultMessage
source: Registration failed. Please try again.
am: ምዝገባ አልተሳካም። እባክዎ እንደገና ይሞክሩ።
or: Galmeessi hin milkoofne. Deebisee yaali.

# selectDepartmentHint
source: Select Department / Stream
am: ቅርንጫፍ / ስትሪም ይምረጡ
or: Damee barnootaa/Stream Filadhu

# yearLabel
source: Academic Year
am: አካዴሚያዊ ዓመት
or: Baroota Barnootaa

# yearValidationErrorEmpty
source: Please enter year.
am: እባክዎ ዓመት ያስገቡ።
or: Waggaa galchi.

# yearValidationErrorInvalid
source: Please enter a valid year.
am: እባክዎ ትክክለኛ ዓመት ያስገቡ።
or: Waggaa sirrii galchi.

# departmentLabel
source: Department
am: ቅርንጫፍ
or: Damee Barnootaa

# pleaseSelectDepartmentError
source: Please select a department.
am: እባክዎ ቅርንጫፍ ይምረጡ።
or: Damee barnootaa filadhu.

# selectYearHint
source: Select Year
am: ዓመት ይምረጡ
or: Waggaa Filadhu

# pleaseSelectYearError
source: Please select your academic year.
am: እባክዎ አካዴሚያዊ ዓመትዎን ይምረጡ።
or: Waggaa barnootaa kee filadhu.

source: Guest User
am: እንግዳ ተጠቃሚ
or: Fayyaddamaa Keessummaa

source: Please login or register
am: እባክዎ ይግቡ ወይም ይመዝገቡ
or: Seeni ykn Galmaa'i

source: Registered User
am: የተመዘገበ ተጠቃሚ
or: Fayyaddamaa Galmaa'e

# logoutSuccess
source: Logged out successfully.
am: በተሳካ ሁኔታ ወጥቷል።
or: Milkaa'inaan ba'eera.

# selectSemesterLabel
source: Select Semester
am: ሴሚስተር ይምረጡ
or: Semeestara Filadhu

# selectSemesterHint
source: Select a Semester
am: ሴሚስተር ይምረጡ
or: Semeestara Filadhu

# pleaseSelectSemesterError
source: Please select a semester.
am: እባክዎ ሴሚስተር ይምረጡ።
or: Semeestara filadhu.

# deviceInfoNotAvailable
source: Device information not available. Please wait and try again.
am: የመሳሪያ መረጃ የለም። እባክዎ ይጠብቁ እና እንደገና ይሞክሩ።
or: Odeeffannoon meeshaa hin argamu. Eegiitii deebisee yaali.

# deviceInfoProcessing
source: Device information is still being processed. Please try again shortly.
am: የመሳሪያ መረጃ አሁንም በመካሄድ ላይ ነው። እባክዎ ትንሽ ቆይተው እንደገና ይሞክሩ።
or: Odeeffannoon meeshaa hojiirra jira. Turtii deebisee yaali.

# deviceInfoInitializing
source: Initializing... Please try logging in again.
am: በመጀመር ላይ... እባክዎ እንደገና ለመግባት ይሞክሩ።
or: Jalqabaa jira... Deebisee seenuuf yaali.

# deviceInfoProceedingDefault
source: Could not fully determine device info.
am: የመሳሪያ መረጃን ሙሉ በሙሉ መወሰን አልተቻለም።
or: Odeeffannoo meeshaa sirriitti adda baasuu hin dandeenye.

source: Initializing...
am: በመጀመር ላይ...
or: Jalqabaa jira...

# enrollForSemesterTitle
source: Enroll for {semesterName}
am: ለ{semesterName} ይመዝገቡ
or: {semesterName}f Galmaa'i

# selectedSemesterLabel
source: Selected Semester:
am: የተመረጠ ሴሚስተር:
or: Semeestara Filatame:

# priceLabel
source: Price:
am: ዋጋ:
or: Gatii:

# coursesIncludedLabel
source: Courses Included:
am: የተካተቱ ትምህርቶች:
or: Koorsoota Keessatti Hammataman:

# bankNamePaymentLabel
source: Bank Name of Payment
am: የክፍያ ባንክ ስም
or: Maqaa Baankii Kaffaltii

# bankNamePaymentHint
source: e.g., Commercial Bank of Ethiopia, Awash Bank
am: ለምሳሌ: የኢትዮጵያ ንግድ ባንክ, አዋሽ ባንክ
or: fkn, Commercial Bank of Ethiopia, Awash Bank

# bankNameValidationError
source: Please enter the bank name.
am: እባክዎ የባንኩን ስም ያስገቡ።
or: Maqaa baankii galchi.

# enrollmentRequestSuccess
source: Enrollment request submitted successfully! Please await approval.
am: የምዝገባ ጥያቄ በተሳካ ሁኔታ ቀርቧል! እባክዎ ማፅደቅ ይጠብቁ።
or: Gaaffiin galmee milkaa'inaan dhiyaateera! Hayyama eegi.

# enrollmentRequestFailed
source: Failed to submit enrollment request.
am: የምዝገባ ጥያቄ ለማቅረብ አልተሳካም።
or: Gaaffii galmee dhiyeessuun hin milkoofne.

# selectPaymentBankPrompt
source: Please select a payment bank for reference.
am: እባክዎ ለማጣቀሻ የሚሆን የክፍያ ባንክ ይምረጡ።
or: Waabiif baankii kaffaltii filadhu.

# goBackButton
source: Go Back
am: ወደ ኋላ ተመለስ
or: Duubatti Deebi'i

# createPostTitle
source: Create New Post
am: አዲስ ልጥፍ ይፍጠሩ
or: Barruu Haaraa Uumi

# postTitleLabel
source: Post Title
am: የልጥፍ ርዕስ
or: Mata Duree Barruu

# postTitleHint
source: Enter a clear and concise title
am: ግልጽ እና አጭር ርዕስ ያስገቡ
or: Mata duree ifaa fi gabaabaa galchi

# postTitleValidationRequired
source: Please enter a title.
am: እባክዎ ርዕስ ያስገቡ።
or: Mata duree galchi.

# postTitleValidationLength
source: Title must be at least 5 characters long.
am: ርዕስ ቢያንስ 5 ቁምፊዎች መሆን አለበት።
or: Mata dureen gabaabduu ta'uu hin qabu, yoo xiqqaate qubee 5 ta'uu qaba.

# postDescriptionLabel
source: Post Description
am: የልጥፍ መግለጫ
or: Ibsa Barruu

# postDescriptionHint
source: Share your thoughts or questions in detail...
am: ሀሳቦችዎን ወይም ጥያቄዎችዎን በዝርዝር ያጋሩ...
or: Yaada ykn gaaffii kee bal'inaan hiri...

# postDescriptionValidationRequired
source: Please enter a description.
am: እባክዎ መግለጫ ያስገቡ።
or: Ibsa galchi.

# postDescriptionValidationLength
source: Description must be at least 10 characters long.
am: መግለጫ ቢያንስ 10 ቁምፊዎች መሆን አለበት።
or: Ibsi gabaabduu ta'uu hin qabu, yoo xiqqaate qubee 10 ta'uu qaba.

# submitPostButton
source: Submit Post
am: ልጥፍ አስገባ
or: Barruu Dhiyeessi

# postCreatedSuccess
source: Post created successfully!
am: ልጥፍ በተሳካ ሁኔታ ተፈጥሯል!
or: Barruun milkaa'inaan uumameera!

# postCreateFailed
source: Failed to create post. Please try again.
am: ልጥፍ መፍጠር አልተሳካም። እባክዎ እንደገና ይሞክሩ።
or: Barruu uumuun hin milkoofne. Deebisee yaali.

# editPostTitle
source: Edit Post
am: ልጥፍ አስተካክል
or: Barruu Sirreessi

# generalTitleLabel
source: Title
am: ርዕስ
or: Mata Duree

# generalTitleEmptyValidation
source: Title cannot be empty
am: ርዕስ ባዶ መሆን የለበትም
or: Mata dureen duwwaa ta'uu hin danda'u

# generalDescriptionLabel
source: Description
am: መግለጫ
or: Ibsa

# generalDescriptionEmptyValidation
source: Description cannot be empty
am: መግለጫ ባዶ መሆን የለበትም
or: Ibsi duwwaa ta'uu hin danda'u

# cancelButton
source: Cancel
am: ይቅር
or: Haqi

# saveButton
source: Save
am: አስቀምጥ
or: Quusadhu

# postUpdatedSuccess
source: Post updated successfully!
am: ልጥፍ በተሳካ ሁኔታ ተዘምኗል!
or: Barruun milkaa'inaan haaromfameera!

# postUpdateFailed
source: Failed to update post.
am: ልጥፍ ማዘመን አልተሳካም።
or: Barruu haaromsuun hin milkoofne.

# deletePostTitle
source: Delete Post
am: ልጥፍ ሰርዝ
or: Barruu Haqii

# deletePostConfirmation
source: Are you sure you want to delete this post and all its comments? This action cannot be undone.
am: ይህን ልጥፍ እና ሁሉንም አስተያየቶች መሰረዝ ይፈልጋሉ? ይህ እርምጃ ሊቀለበስ አይችልም።
or: Barruu kanaa fi yaada isaa hunda haquuf mirkanaa'aa dha? Hojiin kun deebi'ee sirrachuu hin danda'u.

# deleteButton
source: Delete
am: ሰርዝ
or: Haqi

# postDeletedSuccess
source: Post deleted successfully!
am: ልጥፍ በተሳካ ሁኔታ ተሰርዟል!
or: Barruun milkaa'inaan haqameera!

# postDeleteFailed
source: Failed to delete post.
am: ልጥፍ መሰረዝ አልተሳካም።
or: Barruu haquun hin milkoofne.

# commentPostedSuccess
source: Comment posted successfully!
am: አስተያየት በተሳካ ሁኔታ ተለጠፈ!
or: Yaadni milkaa'inaan maxxanfameera!

# commentPostFailed
source: Failed to post comment.
am: አስተያየት ለመለጠፍ አልተሳካም።
or: Yaada maxxansuun hin milkoofne.

# replyPostedSuccess
source: Reply posted successfully!
am: ምላሽ በተሳካ ሁኔታ ተለጠፈ!
or: Deebiin milkaa'inaan maxxanfameera!

# replyPostFailed
source: Failed to post reply.
am: ምላሽ ለመለጠፍ አልተሳካም።
or: Deebii maxxansuun hin milkoofne.

# updateGenericSuccess
source: Update successful!
am: ማዘመን ተሳክቷል!
or: Haaroomsuun milkaa'eera!

# updateGenericFailed
source: Update failed.
am: ማዘመን አልተሳካም።
or: Haaroomsuun hin milkoofne.

# deleteCommentTitle
source: Delete Comment
am: አስተያየት ሰርዝ
or: Yaada Haqii

# deleteReplyTitle
source: Delete Reply
am: ምላሽ ሰርዝ
or: Deebii Haqii

# deleteItemConfirmation
source: Are you sure you want to delete this {itemType}? This action cannot be undone.
am: ይህን {itemType} መሰረዝ ይፈልጋሉ? ይህ እርምጃ ሊቀለበስ አይችልም።
or: {itemType} kana haquuf mirkanaa'aa dha? Hojiin kun deebi'ee sirrachuu hin danda'u.

# itemDeletedSuccess
source: {itemType} deleted successfully!
am: {itemType} በተሳካ ሁኔታ ተሰርዟል!
or: {itemType} milkaa'inaan haqameera!

# itemDeleteFailed
source: Failed to delete {itemType}.
am: {itemType} መሰረዝ አልተሳካም።
or: {itemType} haquun hin milkoofne.

# commentsSectionHeader
source: Comments
am: አስተያየቶች
or: Yaada

# noCommentsYet
source: No comments yet. Be the first!
am: እስካሁን አስተያየት የለም። የመጀመሪያው ይሁኑ!
or: Hanga ammaatti yaanni hin jiru. Kan jalqabaa ta'i!

# writeCommentHint
source: Write a comment...
am: አስተያየት ይጻፉ...
or: Yaada barreessi...

# commentValidationEmpty
source: Comment cannot be empty.
am: አስተያየት ባዶ መሆን የለበትም።
or: Yaadni duwwaa ta'uu hin qabu.

# postCommentTooltip
source: Post Comment
am: አስተያየት አስገባ
or: Yaada Maxxansi

# replyButtonLabel
source: Reply
am: ምላሽ ስጥ
or: Deebii Kenni

# cancelReplyButtonLabel
source: Cancel
am: ይቅር
or: Haqi

# writeReplyHint
source: Write a reply...
am: ምላሽ ይጻፉ...
or: Deebii barreessi...

# replyValidationEmpty
source: Reply cannot be empty.
am: ምላሽ ባዶ መሆን የለበትም።
or: Deebiin duwwaa ta'uu hin qabu.

# editFieldValidationEmpty
source: Cannot be empty
am: ባዶ መሆን አይቻልም።
or: Duwwaa ta'uu hin danda'u

# saveChangesButton
source: Save Changes
am: ለውጦችን አስቀምጥ
or: Jijjiirama Quusadhu

# viewAllReplies
source: View all {replyCount} replies...
am: ሁሉንም {replyCount} ምላሾች ይመልከቱ...
or: Deebii {replyCount} hunda ilaali...

# commentItemDisplay
source: Comment
am: አስተያየት
or: Yaada

# replyItemDisplay
source: Reply
am: ምላሽ
or: Deebii

# darkModeLabel
source: Dark Mode
am: ጨለማ ሁነታ
or: Moodii Gurraacha

# darkModeSubtitle
source: Enable or disable dark theme
am: ጨለማ ገጽታን አንቃ ወይም አሰናክል
or: Teema gurraacha banaa ykn cufi

# receiveNotificationsSubtitle
source: Receive important updates
am: አስፈላጊ ዝመናዎችን ይቀበሉ
or: Odeeffannoo barbaachisaa argadhu

source: Push Notifications Enabled
am: ፑሽ ማሳወቂያዎች ነቅተዋል
or: Beeksisni Push banaa dha

source: Push Notifications Disabled
am: ፑሽ ማሳወቂያዎች ተሰናክለዋል
or: Beeksisni Push cufaa dha

# viewPrivacyPolicyAction
source: View Privacy Policy
am: የግላዊነት ፖሊሲን ይመልከቱ
or: Seera Dhuunfaa Ilaali

# viewTermsAction
source: View Terms of Service
am: የአገልግሎት ውልን ይመልከቱ
or: Waliigaltee Tajaajilaa Ilaali

# actionNotImplemented
source: {featureName}: Not Implemented Yet
am: {featureName}: እስካሁን አልተተገበረም።
or: {featureName}: Hanga ammaatti Hojiirra Hin Oolle

# couldNotLaunchUrl
source: Could not launch {urlString}
am: {urlString} ማስጀመር አልተቻለም
or: {urlString} jalqabuu hin dandeenye

# shareAppSubject
source: MGW Tutorial App
am: MGW ትምህርት መተግበሪያ
or: Appilikeeshinii Hubannoo MGW

# emailSupportSubject
source: App Support Query
am: የመተግበሪያ ድጋፍ ጥያቄ
or: Gaaffii Deggersa Appilikeeshinii

source: Contact via Email
am: በኢሜል ያግኙን
or: Imeeliin Nu Qunnamaa

source: Call Us
am: ይደውሉልን
or: Nu waamaa

source: Visit our Website
am: ድረ-ገጻችንን ይጎብኙ
or: Marsariitii Keenya Dhaabaa

source: Refreshing data...
am: ውሂብ በመታደስ ላይ...
or: Odeeffannoo haaroomsaa jira...

source: Data refreshed!
am: ውሂብ ታድሷል!
or: Odeeffannoon haaromfameera!

# errorRefreshingData
source: Error refreshing data. Please check your internet connection.
am: ውሂብ በማደስ ላይ ስህተት። እባክዎ የኢንተርኔት ግንኙነትዎን ያረጋግጡ።
or: Odeeffannoo haaromsuutti dogoggora. Intarneetii kee mirkaneeffadhu.

# notesSectionTitle
source: Notes
am: ማስታወሻዎች
or: Qabxii

# notesSectionDescription
source: Notes we have collected from students all around the country.
am: ከመላ አገሪቱ የተማሪዎች የተሰበሰቡ ማስታወሻዎች።
or: Qabxii barattoota biyyaa keessaa walitti qabne.

# notesComingSoon
source: Notes section coming soon!
am: የማስታወሻዎች ክፍል በቅርቡ ይመጣል!
or: Kutaan qabxii dafee dhufa!

source: Courses details coming soon.
am: የኮርሶች ዝርዝሮች በቅርቡ ይመጣሉ።
or: Ibsi koorsootaa dafee dhufa.

# semesterCardTapped
source: {semesterName} (ID: {semesterId}) Tapped
am: {semesterName} (መለያ: {semesterId}) ተጭኗል
or: {semesterName} (ID: {semesterId}) Tuqameera

# enrollNowButton
source: Enroll Now
am: አሁን ይመዝገቡ
or: Amma Galmaa'i

# currencySymbol
source: ETB
am: ብር
