Repository: abelhailefen/mgw_tutorial
Catalog: lib/l10n/app_*.arb
Languages: am, or

# submitEnrollmentRequestButton
source: Submit Enrollment Request
am: የምዝገባ ጥያቄ አስገባ
or: Gaaffii Galmee Dhiyeessi

# currentPasswordLabel
source: Current Password
am: ወቅታዊ የይለፍ ቃል
or: Jecha Darbii Ammaa

# newPasswordLabel
source: New Password
am: አዲስ የይለፍ ቃል
or: Jecha Darbii Haaraa

# confirmNewPasswordLabel
source: Confirm New Password
am: አዲስ የይለፍ ቃል አረጋግጥ
or: Jecha Darbii Haaraa Mirkaneessi

source: Passwords do not match
am: የይለፍ ቃላት አይዛመዱም።
or: Jechi darbii hin walsimne.

# newPhoneNumberLabel
source: New Phone Number
am: አዲስ የስልክ ቁጥር
or: Lakkoofsa Bilbilaa Haaraa

# otpEnterPrompt
source: Enter OTP
am: OTP አስገባ
or: OTP Galchi

# otpValidationErrorRequired
source: Please enter OTP
am: እባክዎ OTP ያስገቡ።
or: OTP galchi.

# otpValidationErrorLength
source: OTP must be 6 digits
am: OTP 6 አሃዞች መሆን አለበት።
or: OTP digit 6 ta'uu qaba.

# otpNewPhoneSameAsCurrentError
source: New phone number cannot be the same as current.
am: አዲስ የስልክ ቁጥር አሁን ካለው ጋር ተመሳሳይ መሆን የለበትም።
or: Lakkoofsi bilbilaa haaraan isa ammaa wajjin tokko ta'uu hin qabu.

# otpRequestButton
source: Request OTP
am: OTP ይጠይቁ
or: OTP gaafadhu

# otpVerifyButton
source: Verify OTP
am: OTP ያረጋግጡ
or: OTP mirkaneessi

# passwordChangedSuccess
source: Password changed successfully!
am: የይለፍ ቃል በተሳካ ሁኔታ ተቀይሯል!
or: Jechi darbii milkaa'inaan jijjiirameera!

# passwordChangeFailed
source: Failed to change password.
am: የይለፍ ቃል መቀየር አልተሳካም።
or: Jecha darbii jijjiiruun hin milkoofne.

# otpSentSuccess
source: OTP sent successfully.
am: OTP በተሳካ ሁኔታ ተልኳል።
or: OTP milkaa'inaan ergameera.

# otpRequestFailed
source: Failed to request OTP.
am: OTP መጠየቅ አልተሳካም።
or: OTP gaafachuun hin milkoofne.

# phoneUpdateSuccess
source: Phone number updated successfully.
am: የስልክ ቁጥር በተሳካ ሁኔታ ተዘምኗል።
or: Lakkoofsi bilbilaa milkaa'inaan haaromfameera.

# phoneUpdateFailed
source: Failed to update phone number.
am: የስልክ ቁጥር ማዘመን አልተሳካም።
or: Lakkoofsa bilbilaa haaromsuun hin milkoofne.

# videoItemType
source: Video
am: ቪዲዮ
or: Viidiyoo

# documentItemType
source: Document
am: ሰነድ
or: Sanada

# quizItemType
source: Quiz
am: ፈተና
or: Qormaata

# textItemType
source: Text
am: ጽሑፍ
or: Barreeffama

# unknownItemType
source: Content
am: ይዘት
or: Qabxii

# noVideosAvailable
source: No videos available in this section.
am: በዚህ ክፍል ምንም ቪዲዮዎች የሉም።
or: Kutaa kana keessatti viidiyoo hin jiru.

# noDocumentsAvailable
source: No documents available in this section.
am: በዚህ ክፍል ምንም ሰነዶች የሉም።
or: Kutaa kana keessatti sanada hin jiru.

# noTextLessonsAvailable
source: No text lessons available in this section.
am: በዚህ ክፍል ምንም የጽሑፍ ትምህርቶች የሉም።
or: Kutaa kana keessatti barnoota barreeffamaa hin jiru.

# noQuizzesAvailable
source: No quizzes available in this section.
am: በዚህ ክፍል ምንም ፈተናዎች የሉም።
or: Kutaa kana keessatti qormaata hin jiru.

# itemNotAvailable
source: No content available for {title}.
am: ለ{title} ምንም ይዘት የለም።
or: Qabxiin {title}f hin argamu.

# couldNotLaunchItem
source: Could not launch {url}
am: {url} ማስጀመር አልተቻለም
or: {url} jalqabuu hin dandeenye

# noLaunchableContent
source: No launchable content for {title}
am: ለ{title} የሚጀመር ይዘት የለም
or: Qabxiin {title}f jalqabuu danda'u hin jiru

# chaptersTitle
source: Chapters
am: ምዕራፎች
or: Boqonnaawwan

source: Failed to load chapters: {error}
am: ምዕራፎችን መጫን አልተሳካም: {error}
or: Boqonnaawwan fe'uun hin milkoofne: {error}

# noChaptersForCourse
source: No chapters found for this course.
am: ለዚህ ኮርስ ምንም ምዕራፎች አልተገኙም።
or: Koorsoo kanaaf boqonnaawwan hin argamne.

source: Failed to load lessons: {error}
am: ትምህርቶችን መጫን አልተሳካም: {error}
or: Barnoota fe'uun hin milkoofne: {error}

# noLessonsInChapter
source: No lessons in this chapter.
am: በዚህ ምዕራፍ ውስጥ ትምህርቶች የሉም።
or: Boqonnaa kana keessatti barnoonni hin jiru.

# noCoursesAvailable
source: No courses available at the moment.
am: በአሁኑ ጊዜ ምንም ትምህርቶች የሉም።
or: Yeroo ammaa koorsoon hin jiru.

# shareYourTestimonialTitle
source: Share Your Testimonial
am: የእርስዎን ምስክርነት ያጋሩ
or: Ragaa Kee Hiri

# titleLabel
source: Title
am: ርዕስ
or: Mata Duree

# titleValidationPrompt
source: Please enter a title
am: እባክዎ ርዕስ ያስገቡ
or: Mata duree galchi.

# yourExperienceLabel
source: Your Experience
am: የእርስዎ ልምድ
or: Muuxannoo Kee

# experienceValidationPrompt
source: Please describe your experience
am: እባክዎ ልምድዎን ይግለጹ
or: Muuxannoo kee ibsi.

# submitButtonGeneral
source: Submit
am: አስገባ
or: Dhiyeessi

# testimonialSubmittedSuccess
source: Testimonial submitted! It will appear after approval.
am: ምስክርነት ቀርቧል! ከጸደቀ በኋላ ይታያል።
or: Ragaa dhiyaateera! Erga hayyamamee booda ni mul'ata.

# accountNameLabel
source: Name
am: ስም
or: Maqaa

# changeNameLabel
source: Change Name
am: ስም ቀይር
or: Maqaa Jijjiiri

# firstNameLabel
source: First Name
am: የመጀመሪያ ስም
or: Maqaa Duraa

# lastNameLabel
source: Last Name
am: የአያት ስም
or: Maqaa Abbaa/Akkakoo

# firstNameValidationErrorRequired
source: First name is required
am: የመጀመሪያ ስም ያስፈልጋል
or: Maqaan duraa barbaachisaa dha

# lastNameValidationErrorRequired
source: Last name is required
am: የአያት ስም ያስፈልጋል
or: Maqaan abbaa/akkakoo barbaachisaa dha

# nameChangedSuccess
source: Name changed successfully
am: ስም በተሳካ ሁኔታ ተቀይሯል
or: Maqaan milkaa'inaan jijjiirameera

# nameChangeFailed
source: Failed to change name
am: ስም መቀየር አልተሳካም
or: Maqaa jijjiiruun hin milkoofne

# sessionInvalid
source: Session expired. Please log in again
am: ክፍለ ጊዜው አልፏል። እባክዎ እንደገና ይግቡ
or: Sessiini darbeera. Deebisee seeni.

source: Error Loading Data
am: ውሂብ በመጫን ላይ ስህተት
or: Odeeffannoo fe'uutti dogoggora

source: Retry
am: እንደገና ይሞክሩ
or: Deebisee Yaali

# faqTitle
source: FAQ
am: ተደጋግመው የሚጠየቁ ጥያቄዎች
or: Gaaffilee Yoo Baay'ee Gaafataman

# faqNoItems
source: No FAQ items available at the moment.
am: በአሁኑ ጊዜ ምንም ተደጋግመው የሚጠየቁ ጥያቄዎች የሉም።
or: Yeroo ammaa gaaffilee hin jiru.

source: Video playback error
am: የቪዲዮ መልሶ ማጫወት ስህተት
or: Viidiyoo taphachuutti dogoggora

# otherItemsTabTitle
source: Other Content
am: ሌሎች ይዘቶች
or: Qabxii Biraa

# noOtherVideosInChapter
source: No other videos found in this chapter.
am: በዚህ ምዕራፍ ውስጥ ሌሎች ቪዲዮዎች አልተገኙም።
or: Boqonnaa kana keessatti viidiyoo biroo hin argamne.

# noOtherContentInChapter
source: No other content found in this chapter.
am: በዚህ ምዕራፍ ውስጥ ሌላ ይዘት አልተገኘም።
or: Boqonnaa kana keessatti qabxii biroo hin argamne.

# cannotPlayOtherVideoHere
source: Cannot play other videos from this list.
am: ሌሎች ቪዲዮዎችን ከዚህ ዝርዝር መጫወት አይቻልም።
or: Viidiyoowwan biroo tarree kana irraa taphachuu hin danda'u.

# noOnlineVideoUrlAvailable
source: No online video URL available for this item.
am: ለዚህ ንጥል ነገር ምንም የመስመር ላይ ቪዲዮ URL የለም።
or: Qabxii kanaaf URL viidiyoo online hin jiru.

source: Play Original Online
am: ዋናውን በመስመር ላይ አጫውት
or: Isa Jalqabaa Online Taphachiisi

# unexpectedError
source: An unexpected error occurred:
am: ያልተጠበቀ ስህተት ተፈጠረ:
or: Dogoggora hin eegamne raawwate:

# loginFailedNoUserData
source: Login failed: No user data returned by the server. Please try again or contact support.
am: መግባት አልተሳካም: አገልጋዩ የተጠቃሚ ውሂብ አልመለሰም። እባክዎ እንደገና ይሞክሩ ወይም ድጋፍ ሰጪን ያግኙ።
or: Seenun hin milkoofne: Server odeeffannoo fayyaddamaa hin deebifne. Deebisee yaali ykn deggarsa qunnamaa.

# playDownloadedVideoTooltip
source: Play downloaded video
am: የወረደውን ቪዲዮ አጫውት
or: Viidiyoo buufame taphachiisi

# openDownloadedDocumentTooltip
source: Open downloaded document
am: የወረደውን ሰነድ ክፈት
or: Sanada buufame banaa

source: My Exams
am: የኔ ፈተናዎች
or: Qormaata Kiyya

# errorLoadingExams
source: Failed to load exams. Please try again.
am: ፈተናዎችን መጫን አልተሳካም። እባክዎ እንደገና ይሞክሩ።
or: Qormaata fe'uun hin milkoofne. Deebisee yaali.

# downloadExamTooltip
source: Download Exam
am: ፈተና አውርድ
or: Qormaata Buusi

# cancelDownloadTooltip
source: Cancel Download
am: ማውረድ ይቅር
or: Buusuu Haqi

# deleteExamTooltip
source: Delete Exam
am: ፈተና ሰርዝ
or: Qormaata Haqii

# documentIsDownloadingMessage
source: Document is currently downloading...
am: ሰነድ እየወረደ ነው...
or: Sanadiin bu'aa jira...

# quizIsDownloadingMessage
source: Exam is currently downloading...
am: ፈተና እየወረደ ነው...
or: Qormaanni bu'aa jira...

# couldNotOpenDownloadedFileError
source: Could not open downloaded file
am: የወረደውን ፋይል መክፈት አልተቻለም
or: Faayilii buufame banuu hin dandeenye

# downloadQuizTooltip
source: Download exam
am: ፈተና አውርድ
or: Qormaata buusi

# openDownloadedQuizTooltip
source: Open downloaded exam
am: የወረደውን ፈተና ክፈት
or: Qormaata buufame banaa

# fileDownloadedTooltip
source: File downloaded
am: ፋይል ወርዷል
or: Faayiliin buufameera
